kreier/wob/esp32c3/claude/power_button_penta/sdkconfig.defaults
# ESP32-C3 target
CONFIG_IDF_TARGET="esp32c3"

# BLE / Bluedroid
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
CONFIG_BT_GATTC_ENABLE=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# USB (TinyUSB) – built-in USB on ESP32-C3
CONFIG_TINYUSB_ENABLED=y
CONFIG_TINYUSB_HID_ENABLED=y

# Power / sleep
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# Logging – reduce to save power
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
